Autodesk.Revit.UI.Events.MessageBoxData.DialogType
An integer that describes the standard windows type of the dialog box.

Autodesk.Revit.UI.Events.MessageBoxData.Message
The message that has been displayed in the dialog box.

Autodesk.Revit.UI.Events.MessageBoxData
An object that represents a simple message box that prompts the user
for some action.
Remarks:
When the application receives this object, a simple message box is displayed in Revit that
requires user interaction. The OverrideResult function can be used to cause the dialog
to be dismissed and return a desired result code.